######################################
import string
import random
import math


planets = [['mecrury',  1919],
           ['venus',    18234],
           ['jupiter',  1112112],
           ['mars',     838434],
           ['saturn',   4223232],
           ['earth',    343423]]


planets.sort()
print(planets)


group = [
	['Пасибаева Ольга', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Семков Дмитрий', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Ивасюк Дарья', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Филипчук Алексей', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,1,1,1,0,0,0,0,0,0,0'],
	['Чугунова Кристина', '1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Азаренков Артур', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Николаева Евгения', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Кучанский Александр', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Макеев Александр', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Берёза Дмитрий ', '1,1,1,1,1,1,1,1,1,1,1,1,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Алохин Эдгар', '0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Пекарский Ярослав', '1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0'],
	['Доманина Дария', '1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0']
]


def print_full_names(group):
    print('--- Students ---')
    for i in range(len(group)):
        print(group[i][0])

print_full_names(group)

def print_full_names_sorted(group):
    group.sort(key=lambda elem: elem[0].split()[1])
    print_full_names(group)

print_full_names_sorted(group)

def print_ranks(group):
    print('---Students ranks ----')
    for i in range(len(group)):
        #print(group[i][1])
        total_rank = group[i][1].count('1')
        total_rank_2 = sum([int(elem) for elem in group[i][1].split(',')])
        print(group[i][0], total_rank, total_rank_2)
        group[i][1] = total_rank

print_ranks(group)

def get_ranks_sorted(group):
    group.sort(key=lambda elem: elem[1], reverse=True)
    print('--- Students rank sorted ---')
    for i in range(len(group)):
        print(group[i][0], group[i][1])

get_ranks_sorted(group)


def print_top_n(group, n=3):
    print('*************Top %d students*************' % n)
    for i in range(n):
        print(group[i][0], group[i][1])

print_top_n(group,5)
